Revit 2027 API
AnalysisResultSchema.IsVisible Property
 If true analysis result is visible in view
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVisible { get; set; }
Public Property IsVisible As Boolean
	Get
	Set
public:
property bool IsVisible {
	bool get ();
	void set (bool value);
}
member IsVisible : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace